app/controllers/books_controller.rb

SELECT * FROM "books"
---
  def index
    @books = Book.all

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def show
    @book = Book.find(params[:id])

INSERT INTO "books" ("created_at", "title", "author", "updated_at", "user_id") VALUES('2011-01-11 23:08:32', 'bookd', 'tom', '2011-01-11 23:08:32', NULL)
---
  def create
    @book = Book.new(params[:book])
    if @book.save