app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "role_type", "password_salt", "password_hash", "email") VALUES('2011-03-06 22:16:43', '2011-03-06 22:16:43', 'honeypot', NULL, '00d595e0d9005da566f50f422bfacec93c75b6c6', '53d52825a1acc000eb4852e6f7d42fbaaae835bf', 'lasdjlsfdj@honyepot.com')